from matplotlib.colors import ListedColormap

# -------------------------
# Размеры поля
# -------------------------
WIDTH = 120
HEIGHT = 120

# -------------------------
# Состояния клеток
# -------------------------
EMPTY = 0  # пустая территория
TREE = 1  # дерево
FIRE_1 = 2  # начальная стадия горения
FIRE_2 = 3  # средняя стадия горения
FIRE_3 = 4  # последняя стадия горения
BURNT = 5  # сгорешвая территория
FIREBREAK = 6  # негорящее препятсвие
SPARK = 7  # искра
MAX_STATE = SPARK

# -------------------------
# Цвета состояний
# -------------------------
colors = [
    "#D9C7A3",  # EMPTY — сухая земля, светло-бежевый
    "#1F7A3A",  # TREE — насыщенный зеленый лес
    "#FFD166",  # FIRE_1 — слабое горение, желто-оранжевый
    "#F77F00",  # FIRE_2 — активное горение, оранжевый
    "#D62828",  # FIRE_3 — сильное горение, красный
    "#2B2B2B",  # BURNT — сгоревшая территория, почти черный
    "#277DA1",  # FIREBREAK — противопожарный разрыв, спокойный синий
    "#FFF200",  # SPARK — искра, ярко-желтый
]

cmap = ListedColormap(colors)

# -------------------------
# Начальные параметры модели
# -------------------------
params = {
    "fire_probability": 0.55,  # базовая вероятность распространения огня
    "diagonal_factor": 0.7,  # ослабление распространения по диагонали
    "forest_density": 0.86,  # плотность леса
    "humidity": 0.1,  # влажность
    "wind_direction": "right",  # направление ветра
    "wind_strength": 0.4,  # сила ветра
    "spark_probability": 0.04,  # вероятность появления искры
    "max_spark_distance": 12,  # максимальное расстояние полета искры
}
